[{
    "title": "¿Cómo enviar un mail con Spring Boot?",
    "description": "Corta implementación de un proyecto para enviar mails. Los sistemas de correo electrónico se basan en un modelo de almacenamiento y reenvío, de modo que no es necesario que ambos extremos se encuentren conectados simultáneamente. Para ello se emplea un servidor de correo que hace las funciones de intermediario, guardando temporalmente los mensajes antes de enviarse a sus destinatarios.",
    "pubDate": "2022 9 3",
    "link": "https://medium.com/karibu-blog/c%C3%B3mo-enviar-un-mail-con-spring-boot-f86c2f7af678",
    "image": "https://miro.medium.com/v2/resize:fit:1400/format:webp/0*umGqL9oYFFGoRsvC.jpg",
    "techIdList": [ "spring" ]
}, {
    "title": "SpringBoot — Criteria— JPA.",
    "description": "En sistemas donde trabajamos con información gestionada con JPA (Java Persistance API), no es difícil tomar la decisión incorrecta a la hora de hacer una consulta compleja en la base de datos, ya que es realmente sencillo hacer consultas simples con JpaRepository por ejemplo. Pero qué pasa cuando necesitamos hacer una consulta más compleja o condicionada? ...",
    "pubDate": "2022 9 3",
    "link": "https://medium.com/karibu-blog/springboot-criteria-jpa-296ed53beb1f",
    "image": "https://miro.medium.com/v2/resize:fit:1400/format:webp/1*rzbeIdxLuSExPoakboHmZg.jpeg",
    "techIdList": [ "spring" ]
},{
    "title": "¿Cómo configurar un proxy con Nuxt?",
    "description": "Los proyectos orientados a servicios siempre tienen la problemática de comunicación entre servidores, debido a los problemas del CORS, más los problemas del proxy, entre otros. En este caso siempre se usan servidores como apache, glassfish o nginx, entre otros. Estos servidores facilitan la comunicación entre una aplicación web y una aplicación rest...",
    "pubDate": "2022 9 3",
    "link": "https://medium.com/karibu-blog/c%C3%B3mo-configurar-un-proxy-con-nuxt-c55766db18db",
    "image": "https://miro.medium.com/v2/resize:fit:4800/format:webp/1*oHDK9BM0ZGvownwhoL7vfg.png",
    "techIdList": [ "nuxtjs" ]
},{
    "title": "Cómo aplicar JPA en Spring Boot?",
    "description": "Spring es un framework​ que abarca un conjunto estandarizado de conceptos, prácticas y criterios para llevar a cabo la resolución de un problema, además tiene herramientas para llevar el desarrollo de la solución de una manera más fácil y rápida. Spring Boot es un proyecto de Spring donde su función principal es facilitar la creación de aplicaciones Java.",
    "pubDate": "2022 9 3",
    "link": "https://medium.com/karibu-blog/c%C3%B3mo-aplicar-jpa-en-spring-boot-e45ac5bee3b4",
    "image": "https://miro.medium.com/v2/resize:fit:4800/format:webp/1*e44SxykP4UjV4fuUGL07Og.png",
    "techIdList": [ "spring" ]
},{
    "title": "¿Por qué utilizar docker-compose?",
    "description": "Muchas veces en los proyectos de informática, se considera complicada la instalación para comenzar el desarrollo de algún sistema o alguna aplicación. Esto abarca problemas tanto de espacio en el equipo, como que el sistema operativo incompatible, o bien, problemas de conexión para descargar los programas necesarios para llevar a cabo el desarrollo, entre otros.",
    "pubDate": "2022 9 3",
    "link": "https://medium.com/karibu-blog/por-qu%C3%A9-utilizar-docker-compose-d23970c3590d",
    "image": "https://miro.medium.com/v2/resize:fit:4800/format:webp/1*JaWCMN5LM-EuwqxUrREkrw.jpeg",
    "techIdList": [ "docker" ]
}]