[{
    "title": "Product & Pricing Portfolio - FTC",
    "description": "Parte del equipo de desarrollo, participo en la implementación de los diferentes requerimientos hacia el producto.",
    "projectDetail": {
        "technicalDescription": "Bajo una arquitectura orientada a eventos, se está trabajando con diferentes micro-servicios desarrollados en Go, Micronaut y Spring Boot para el backend. Para la interfaz de usuario, se está trabajando con Micro Frontend usando: Webpack 5, Module Federation, y Vue 3, aplicando Atomic Design para manejar las distintas funcionalidades.Parte del equipo de desarrollo, participo en la implementación de los diferentes requerimientos hacia el producto. Bajo una arquitectura orientada a eventos, se está trabajando con diferentes micro-servicios desarrollados en Go, Micronaut y Spring Boot para el backend. Para la interfaz de usuario, se está trabajando con Micro Frontend usando: Webpack 5, Module Federation, y Vue 3, aplicando Atomic Design para manejar las distintas funcionalidades.",
        "techIdList": [
            "go",
            "micronaut-img",
            "spring",
            "vuejs",
            "react",
            "googlecloud",
            "terraform"
        ]
    },
    "initialDate": "jun. 2022",
    "finishDate": null,
    "companyId": "falabella",
    "imageId": "falabella-2.png"
}, {
    "title": "Sucursal Virtual - Sermecoop",
    "description": "Se trabajó en la creación de la sucursal virtual junto al equipo de Sermecoop.",
    "projectDetail": {
        "technicalDescription": "Se trabajó en la creación de la sucursal virtual junto al equipo de Sermecoop, formé parte de una célula ágil de desarrollo, analizando e implementando las funcionalidades requeridas por él área de negocio. Se trabajó con trello para la organización de las tareas.",
        "techIdList": [
            "apache",
            "nestjs",
            "nuxtjs",
            "vuejs",
            "mysql",
            "jenkins",
            "cypress"
        ]
    },
    "initialDate": "sept. 2021",
    "finishDate": "jun. 2022",
    "companyId": "sermecoop",
    "imageId": "sermecoop-1.png"
}, {
    "title": "Portal Clientes - Volta",
    "description": "Se llevó a cabo la creación de un Portal para poder agendar el ingreso de residuos a las diferentes sucursales de Volta",
    "projectDetail": {
        "technicalDescription": "Se llevó a cabo la creación de un Portal para poder agendar el ingreso de residuos a las diferentes sucursales de Volta, con esto resolvimos el problema de comunicación que tenían entre las diferentes áreas al momento de ingresar residuos a una sucursal. En el equipo se implementaron buenas prácticas como lo es la integración continua y la entrega continua, trabajando con una arquitectura de micro servicios",
        "techIdList": [
            "nestjs",
            "nuxtjs",
            "vuejs",
            "postgresql",
            "jenkins",
            "docker"
        ]
    },
    "initialDate": "ago. 2021",
    "finishDate": "oct. 2021",
    "companyId": "volta",
    "imageId": "volta-1.png"
}, {
    "title": "Tótem Auto Atención - Chilquinta",
    "description": "Junto al equipo de negocio y digital de Chilquinta, se lograron levantar requerimientos e implementarlos de manera correcta, levantando una base y un ambiente de desarrollo estable para el proyecto.",
    "projectDetail": {
        "technicalDescription": "Técnicamente para la aplicación con la que el usuario interactúa se encapsuló una aplicación nuxt con electron para ser levantado como kiosko en un hardware entregado por otro proveedor. Y para poder utilizar las api serverless que se usan en la sucursal virtual, se creó una implementación con fastify para no depender totalmente de serverless ya que la aplicación para este proyecto iba a estar en un ambiente offline.",
        "techIdList": [
            "nuxtjs",
            "vuejs",
            "serverless-img",
            "lambdafunction-img",
            "cloudfront-img",
            "storyblok-img"
        ]
    },
    "initialDate": "ago. 2021",
    "finishDate": "sept. 2021",
    "companyId": "chilquinta",
    "imageId": "chilquinta-1.png"
}, {
    "title": "Pago en cuotas sin intereses - VTR",
    "description": "Se implementó junto una solución para validar que el pago con una condición establecida por el área de negocio.",
    "projectDetail": {
        "technicalDescription": "Se integró con la api de transbank de tal manera en que no se cobre intereses en las cuotas(usado para pagar dispositivos móviles), haciendo cambios en una aplicación spring boot, integrándose con un elástic search para buscar las condiciones y usando redis para el caché de la aplicación. Además de esto se hicieron cambios en la aplicación web hecha con Vue.",
        "techIdList": [
            "redis",
            "spring",
            "vuejs",
            "weblogic-img"
        ]
    },
    "initialDate": "jun. 2021",
    "finishDate": "jul. 2021",
    "companyId": "vtr",
    "imageId": "vtr-2.png"
}, {
    "title": "Nuevos Features - Jidoit",
    "description": "Trabajando de la mano con Deiry se desarrollaron funcionalidades para mejorar la productividad de su producto.",
    "projectDetail": {
        "technicalDescription": "",
        "techIdList": [
            "java",
            "angularjs",
            "spring"
        ]
    },
    "initialDate": "may. 2021",
    "finishDate": "jun. 2021",
    "companyId": "jidoit",
    "imageId": "jidoit-1.png"
}, {
    "title": "Mejoras Data Studio - SAWA",
    "description": "Se llevó a cabo una investigación para conseguir la mejor alternativa de solución a un problema que se estaba presentando en la reporteria del cliente.",
    "projectDetail": {
        "technicalDescription": "Se implementó un pgbouncer entre la comunicación del Data Studio y la base de datos Mongo hosteada en Azure. Los errores fueron corregidos de manera correcta con esta solución. Más adelante se particionaron las tablas de la base de datos para completar la implementación de la solución.",
        "techIdList": [
            "postgresql",
            "google",
            "googlecloud"
        ]
    },
    "initialDate": "may. 2021",
    "finishDate": "jun. 2021",
    "companyId": "jidoit",
    "imageId": "jidoit-1.png"
}, {
    "title": "Célula Ágil - Vitamina.",
    "description": "Con el fin de reforzar el área de desarrollo de Vitamina y desarrollar varias funcionalidades, se propuso una célula ágil.",
    "projectDetail": {
        "technicalDescription": "Se trabajó en conjunto con el equipo de Vitamina, incentivando la metodología ágil, adaptándonos a la arquitectura que ya estaba implementada. Ademas se agregaron pruebas automatizadas para el sitio usando Selenium.",
        "techIdList": [
            "csharp",
            "angularjs",
            "sqlserver",
            "selenium",
            "nginx"
        ]
    },
    "initialDate": "ene. 2021",
    "finishDate": "may. 2021",
    "companyId": "vitamina",
    "imageId": "vitamina-1.png"
}, {
    "title": "Mejoras Portal de Pago - VTR",
    "description": "Se realizó en conjunto una serie de actividades para optimizar el seguimiento de los posibles errores en las aplicaciones de pago para el portal público y privado.",
    "projectDetail": {
        "technicalDescription": "Se realizó en conjunto una serie de actividades para optimizar el seguimiento de los posibles errores en las aplicaciones de pago para el portal público y privado.",
        "techIdList": [
            "redis",
            "spring"
        ]
    },
    "initialDate": "dic. 2020",
    "finishDate": "ene. 2021",
    "companyId": "vtr",
    "imageId": "vtr-1.png"
}, {
    "title": "Sucursal Virtual - Chilquinta",
    "description": "Se optimizó la experiencia de usuario en la sucursal virtual de Chilquinta.",
    "projectDetail": {
        "technicalDescription": "Se integró el sitio con Storyblok, un CMS Headless para manejar el contenido. Para el front se utilizo un framework de aplicaciones web y para el backend se trabajo con un una arquitectura Serverless para la comunicacion de los servicios que estaban en la red interna de Chilquinta.",
        "techIdList": [
            "nuxtjs",
            "vuejs",
            "serverless-img",
            "cloudfront-img",
            "amazonwebservices",
            "storyblok-img"
        ]
    },
    "initialDate": "jul. 2020",
    "finishDate": "dic. 2020",
    "companyId": "chilquinta",
    "imageId": "chilquinta-1.png"
}, {
    "title": "Migración SV 2 AWS - VTR.",
    "description": "Junto a un equipo devops de Aaxis se logro migrar la sucursal virtual de VTR desde unos servidores OnPremise a Amazon Web Service.",
    "projectDetail": {
        "technicalDescription": "Utilizando diferentes componentes y herramientaspara lograr la migración de todo el UI de la Sucursal Virtual a la nube. En especifico se migro un sistema web Angular 1.7 desde un Oracle WCS a Cloudfront. Donde se tuvo que adaptar una serie de cosas para que funcionara. Desde el login y la seguridad donde se tuvo que adaptar el backend para que funcionara con u token de WSO2, hasta manejar la seguridad de los archivos del spa con Lambda@Edge. Ademas se esto se configuraron todas las rutas del spa para que pasaran por un API Gateway que estaba protegido por un Lambda Authorizer que validaba el token de la sesión. ",
        "techIdList": [
            "spring",
            "amazonwebservices",
            "redis",
            "wso2-img",
            "nginx",
            "terraform"
        ]
    },
    "initialDate": "sep. 2019",
    "finishDate": "abr. 2020",
    "companyId": "vtr"  ,
    "imageId": "vtr-1.png"  
}, {
    "title": "Visor de Boleta - VTR.",
    "description": "Se desarrollo un sistema web para visualizar las 12 ultimas boletas de un cliente, ademas de un cambio de arquitectura en el backend se integro con el OSB de VTR para obtener los datos necesarios para generar el la boleta, esto contando una integracion con SIEBEL.",
    "projectDetail": {
        "technicalDescription": "",
        "techIdList": [
            "vuejs",
            "spring",
            "redis",
            "nginx",
            "weblogic-img",
            "cloudfront"
        ]
    },
    "initialDate": "abr. 2019",
    "finishDate": "may. 2020",
    "companyId": "vtr"  ,
    "imageId": "vtr-1.png"  
}, {
    "title": "Portal SSTT - VTR.",
    "description": "En VTR realizamos un portal de solicitudes técnicas.",
    "projectDetail": {
        "technicalDescription": "Los usuarios del sistema web pueden cambiar el estado de las ordenes, sacar reportes de los datos, también se genero una funcionalidades de alertas para manejar el tiempo de cada orden y priorizar según eso. Se creó una cola JMS para manejar las solicitudes.",
        "techIdList": [
            "angularjs",
            "spring",
            "nginx",
            "mysql"
        ]
    },
    "initialDate": "jul. 2019",
    "finishDate": "oct. 2019",
    "companyId": "vtr"  ,
    "imageId": "vtr-1.png"  
}, {
    "title": "Agendador - Claro Chile",
    "description": "Junto al equipo de negocios de Claro Chile desarrollamos una herramienta que permitiera gestionar las diferentes solicitudes provenientes del cliente.",
    "projectDetail": {
        "technicalDescription": "Integrándonos con TOA y trabajando con herramientas de Oracle como Weblogic para desplegar las aplicaciones, OSB para orquestar los servicios. Capaz de agendar, manejar y asignar diferentes tipos de solicitudes. El sistema cuenta una bitácora de lo cambios que han tenido las solicitudes desde su creación.",
        "techIdList": [
                "angularjs",
                "spring",
                "oraclesql-img"
        ]
    },
    "initialDate": "jul. 2019",
    "finishDate": "oct. 2019",
    "companyId": "claro"  ,
    "imageId": "claro-1.png"  
}, {
    "title": "Panel de gestion financiera - SODIMAC",
    "description": "Se logro realizar un proyecto para visualizar las finanzas en SODIMAC.",
    "projectDetail": {
        "technicalDescription": "El proyecto se basa en la lectura de un excel que contempla toda la data financiera de sodimac en las diferentes tiendas, centros de costo, activos. Con esta data se realizaron diversas funcionalidades como graficos de comparacion entre tienda y tienda, graficos de comparacion por año, control de la data en una tabla HTML Dinamica donde se mostraba el detalle mensual de los gastos y costos de cada uno de las cuentas.",
        "techIdList": [
                "angularjs",
                "spring",
                "highcharts-img",
                "microsoftsqlserver"
        ]
    },
    "initialDate": "dic. 2018",
    "finishDate": "may. 2019",
    "companyId": "sodimac",
    "imageId": "sodimac-1.png"
}, {
    "title": "Sistema de control de accesos - Sodimac.",
    "description": "Se logro realizar un proyecto para llevar el control de asistecia en SODIMAC.",
    "projectDetail": {
        "technicalDescription": "El proyecto cuenta con una serie de funcionalidades en las que las que mas se destacan son: reportes de asistecia, reportes financieros, monitoreo de los empleados(hora de llegada, hora de salida), monitoreo de las tiendas. Junto a esto se implemento una tablet en cada tienda con un sistema offline el cual tendria la función de registrar a los usuarios para que marcaran su ingreso con la huella digital, usando un dispositivo Secugen y su SDK para Java.",
        "techIdList": [
                "angularjs",
                "spring",
                "electron-original",
                "amazonwebservices",
                "sns-img",
                "sqs-img"
        ]
    },
    "initialDate": "may. 2018",
    "finishDate": "abr. 2019",
    "companyId": "sodimac",
    "imageId": "sodimac-1.png"
}, {
    "title": "Sitio Web - Ecoser",
    "description": "Desarrollo de aplicación web para Ecoser donde el usuario puede ver reportes y los estados de sus solicitudes.",
    "projectDetail": {
        "technicalDescription": "Desarrollo de aplicación web para Ecoser donde se levantaron unos endpoints para poder ser consumidos por la aplicacacion web Volta donde eran estos servicios los que almacenaban la informacion para poder posteriormente ser la data que se mostraria en los reportes que generaba esta misma aplicación.",
        "techIdList": [
                "jsp-img",
                "spring"
        ]
    },
    "initialDate": "nov. 2017",
    "finishDate": "mar. 2018",
    "companyId": "volta",
    "imageId": "volta-1.png"
}, {
    "title": "Volta - Ecoser",
    "description": "Se desarrolló para Ecoser una aplicación movil para calcular la cantidad de desechos y almacenarlos para trabajar con los datos posteriormente.",
    "projectDetail": {
        "technicalDescription": "En la aplicación el usuario podia ingresar la bodega, el tipo de residuo, y el peso de la carga, donde el peso respetaba ciertos estandares segun el tipo de residuo.",
        "techIdList": [
            "android",
            "sqlite",
            "svn"
        ]
    },
    "initialDate": "dic. 2017",
    "finishDate": "feb. 2018",
    "companyId": "volta",
    "imageId": "volta-1.png"
}, {
    "title": "Sucursal Virtual - VTR",
    "description": "Formé parte de la celula e-care como QA.",
    "projectDetail": {
        "technicalDescription": "Ejecuté un plan de pruebas para certificar los desarrollos de la sucursal virtual de VTR, realizé pruebas de regresion en cada paso a produccion en el sitio web. Ejecutamos con el equipo un conjunto de pruebas de integracion con los servicios SOAP. Con una herramienta de automatizacion(Jidoit), se hicimos tambien varias pruebas automatizadas para probar las distintas funcionalidades de la Sucursal Virtual.",
        "techIdList": [
                "postman",
                "soapui",
                "jidoit"
        ]
    },
    "initialDate": "jun. 2017",
    "finishDate": "nov. 2017",
    "companyId": "vtr",
    "imageId": "vtr-1.png"
}]